src/Tasks/ЗадачаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>ЗадачаПользователей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаТема</Name>
					<Comment>Содержание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПредмет</Name>
					<Comment>Предмет задачи</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаАвтор</Name>
					<Comment>Автор бизнес-процесса, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Comment>Подробное описание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаНазначеннаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеИспользовать</Name>
					<Comment>Напоминать о задаче</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеРежим</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНапоминаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЗадачи</Name>
					<Comment>Представление задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

src/Enums/ВариантыНапоминаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыНапоминаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерезУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСобытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаВремяОтносительноСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПосещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВМоментСозданияЗадачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Взаимодействие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Взаимодействие</Name>
			<Comment>Взаимодействие</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПредмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийЗвонокАбонент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийЗвонокНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗаписьНаСледующийПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииКлиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Tasks/ЗадачаПользователей/Forms/ФормаЗадачи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// При создании формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если это новая задача
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		
		Если НЕ ЗначениеЗаполнено(Объект.ЗадачаПредмет) Тогда
			Объект.ЗадачаПредмет = ?(Параметры.Свойство("Предмет"),Параметры.Предмет,Неопределено);
		КонецЕсли;
		
		Если Объект.ЗадачаПредмет = Неопределено ИЛИ Объект.ЗадачаПредмет.Пустая() Тогда
			Объект.ЗадачаНазначеннаяДатаВыполнения = ТекущаяДата();
		ИначеЕсли ТипЗнч(Объект.ЗадачаПредмет) = Тип("ДокументСсылка.Взаимодействие") Тогда 	
			Объект.ЗадачаНазначеннаяДатаВыполнения = Объект.ЗадачаПредмет.НапоминаниеДатаНачала;
		КонецЕсли;        		
		
		Если Параметры.Свойство("Контрагент") Тогда
			Объект.ЗадачаПредмет = Параметры.Контрагент;			 
		КонецЕсли;
		
		Элементы.ФормаКнопкаВыполнить.Доступность  = Ложь;
		Элементы.ФормаКнопкаПрекратить.Доступность = Ложь;
		
	ИначеЕсли Объект.Выполнена Тогда
		
		ЭтаФорма.ТолькоПросмотр                         = Истина;
		Элементы.ГруппаПараметрыНапоминания.Доступность = Ложь;
		Элементы.ФормаКнопкаПрекратить.Доступность      = Ложь;
		
	КонецЕсли;
	
	// Установка представления предмета задачи
	ПредметПредставление = ?(Объект.ЗадачаПредмет = Неопределено ИЛИ Объект.ЗадачаПредмет.Пустая(),"Нет предмета задачи.",Строка(Объект.ЗадачаПредмет));
		
	// Установка информации об авторе
	Элементы.ИнформацияАвтор.Заголовок = "Создана: "+Объект.ЗадачаАвтор.Наименование+", "+Строка(Объект.Дата);
	
	// Заполнение списка режимов напоминания
	ЗаполнитьСписокВыбораРежимаНапоминания();
	
	//// Сохранение вводимых значений
	// СохранениеВводимыхЗначений.ЗаполнитьСписокВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);

КонецПроцедуры

&НаКлиенте
// Обработчик открытия формы на клиенте
Процедура ПриОткрытии(Отказ)
	
	// Установить текущий выбранный режим напоминания
	Для Каждого Элемент ИЗ Элементы.РежимНапоминания.СписокВыбора Цикл
		
		Если Элемент.Значение.Режим = Объект.НапоминаниеРежим  Тогда
			
			Если Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЧерезУказанноеВремя") Тогда 
				
				 Если Элемент.Значение.Интервал =  Объект.НапоминаниеДатаНачала - Объект.Дата Тогда
					 
					 РежимНапоминания = Элемент.Значение;
					 Прервать;
					 
				 КонецЕсли;
				 
			 ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия") Тогда
				 
				     РежимНапоминания            = Элемент.Значение;
					 НапоминаниеИнтервалДоНачала = Объект.ЗадачаНазначеннаяДатаВыполнения - Объект.НапоминаниеДатаНачала;					 				
					 Прервать;
					 
			 Иначе
				 
				 РежимНапоминания = Элемент.Значение;
				 Прервать;
				 
			 КонецЕсли;
			 
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнить список выбора времени напоминания 
	МассивПериодов = Новый Массив;
    СтруктураВремени               = ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(Объект.НапоминаниеДатаНачала, Объект.СтруктурнаяЕдиница);
	СтруктураВремени.ДатаНачала    = ?(ЗначениеЗаполнено(СтруктураВремени.ДатаНачала),СтруктураВремени.ДатаНачала,Дата("00010101080000"));
	СтруктураВремени.ДатаОкончания = ?(ЗначениеЗаполнено(СтруктураВремени.ДатаОкончания),СтруктураВремени.ДатаОкончания,Дата("00010101220000"));
	
	МассивПериодов.Добавить(СтруктураВремени);	
	СписокВеремени = РаботаСДиалогами.ВернутьСписокВремени(МассивПериодов                       , Истина);	
	
	Элементы.ВремяНапоминания.СписокВыбора.Очистить();
	Для Каждого Элемент ИЗ СписокВеремени Цикл	
		
	     Элементы.ВремяНапоминания.СписокВыбора.Добавить(Элемент.Значение,Элемент.Представление);
		 
	КонецЦикла;
	
	// Настройка отображения элементов режима напоминания
	Если Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия") Тогда
		
		Элементы.ИнтервалДоНапоминания.Видимость = Истина;
		Элементы.ДатаНапоминания.Видимость       = Ложь;
		Элементы.ВремяНапоминания.Видимость      = Ложь;
			
	ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ВУказанноеВремя") Тогда 	
		
	    Элементы.ИнтервалДоНапоминания.Видимость = Ложь;
		Элементы.ДатаНапоминания.Видимость       = Истина;
		Элементы.ВремяНапоминания.Видимость      = Истина;
								
	ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ПоСобытию") Тогда 
		
		Элементы.ИнтервалДоНапоминания.Видимость = Ложь;
		Элементы.ВремяНапоминания.Видимость      = Ложь;
		Элементы.ДатаНапоминания.Видимость       = Ложь;
				
    ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЧерезУказанноеВремя") Тогда 
		
		Элементы.ИнтервалДоНапоминания.Видимость = Ложь;
		Элементы.ВремяНапоминания.Видимость      = Ложь;
		Элементы.ДатаНапоминания.Видимость       = Ложь;
			
    КонецЕсли;
	
	// ФормаКлиент = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты");
	// ФормаЗадачи = ПолучитьФорму("Задача.ЗадачаПользователей.Форма.ФормаСписка");
	// Если ФормаКлиент.Открыта() Тогда
	//	
	// КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Обработчик перед записью формы на клиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия") Тогда
		
		Если НапоминаниеИнтервалДоНачала = 0 Тогда
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите через какое время необходимо напомнить!");
			
		КонецЕсли;

		Объект.НапоминаниеДатаНачала = Объект.ЗадачаНазначеннаяДатаВыполнения - НапоминаниеИнтервалДоНачала;
			
	ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ВУказанноеВремя") Тогда 	
		
		Если Объект.НапоминаниеДатаНачала = НачалоДня(Объект.НапоминаниеДатаНачала) Тогда
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите время предупреждения!");
			
		КонецЕсли;
												
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанаЗадачаПользователя", Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СпециальныеОбработчики   

&НаКлиенте
// Обработчик открытия формы кэш списка вводимых значений
Процедура Подключаемый_ОбработчикКэшЛист(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	// СтандартнаяОбработка = Ложь;
	// СохранениеВводимыхЗначенийКлиент.ОбработчикВызоваФормыРедактированияКэшСписка(Элемент,ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Обработка нажатия по гиперссылке предмет задачи
Процедура ПредметНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Объект.ЗадачаПредмет);
	
КонецПроцедуры

&НаКлиенте
// Обработчик записи и закрытия формы
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Записать();
		Закрыть(Истина);		
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик выполнения задачи
Процедура ВыполнитьЗадачу(Команда)
		
	Объект.ДатаИсполнения = ТекущаяДата();
	Объект.Выполнена      = Истина;
	
    ЗаписатьИЗакрыть(Неопределено);
	ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.ЗадачаПользователей.ПустаяСсылка"));
	ОповеститьОбИзменении(ПредопределенноеЗначение("Документ.Взаимодействие.ПустаяСсылка"));
	Оповестить("ЗадачаПользователя",Объект.Ссылка);
	Оповестить("ИзменениеСпискаВзаимодействий");

КонецПроцедуры

&НаКлиенте
// Обработчик прекращения напоминания
Процедура Прекратить(Команда)
	
	Объект.НапоминаниеИспользовать = Ложь;
    ЗаписатьИЗакрыть(Неопределено);

	ОповеститьОбИзменении(Объект.Ссылка);
	Оповестить("ЗадачаПользователя",Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
// При изменении даты напоминания
Процедура ДатаНапоминанияПриИзменении(Элемент)
	
	// Перезаполнить список выбора времени напоминания 
	МассивПериодов                 = Новый Массив;
	СтруктураВремени               = ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(Объект.НапоминаниеДатаНачала, Объект.СтруктурнаяЕдиница);
	СтруктураВремени.ДатаНачала    = ?(ЗначениеЗаполнено(СтруктураВремени.ДатаНачала),СтруктураВремени.ДатаНачала,Дата("00010101080000"));
	СтруктураВремени.ДатаОкончания = ?(ЗначениеЗаполнено(СтруктураВремени.ДатаОкончания),СтруктураВремени.ДатаОкончания,Дата("00010101220000"));
	
	МассивПериодов.Добавить(СтруктураВремени);	
	СписокВеремени = РаботаСДиалогами.ВернутьСписокВремени(МассивПериодов, Истина);	
	
	Элементы.ВремяНапоминания.СписокВыбора.Очистить();
	Для Каждого Элемент ИЗ СписокВеремени Цикл	
		
	     Элементы.ВремяНапоминания.СписокВыбора.Добавить(Элемент.Значение,Элемент.Представление);
		 
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Заполнить список выбора режима напоминания
Процедура ЗаполнитьСписокВыбораРежимаНапоминания(ЗаполнитьПоУмолчанию = Истина)
	
	Элементы.РежимНапоминания.СписокВыбора.Очистить();
	Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,-1),"Не напоминать");
	Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЗаВремяОтносительноСобытия,0),"Относительно срока");
    Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ВУказанноеВремя,0),"В указанное время");
	
	Если Объект.ЗадачаПредмет <> Неопределено И ТипЗнч(Объект.ЗадачаПредмет)=Тип("СправочникСсылка.Контрагенты") Тогда
		
		Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ПоСобытию,0),"По посещению клиента");
		
	КонецЕсли;
	
	Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,300),"через 5 минут");
    Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,600),"через 10 минут");
	Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,900),"через 15 минут");
	Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,1200),"через 30 минут");     
	Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,3600),"через 1 час");
	Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,7200),"через 2 часа");
    Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,14400),"через 4 часа");
    Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,28800),"через 8 часов");
    Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,86400),"через 1 день");
    Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,172800),"через 2 дня");
    Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,259200),"через 3 дня");
    Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,604800),"через 1 неделю");
    Элементы.РежимНапоминания.СписокВыбора.Добавить(Новый Структура("Режим,Интервал",Перечисления.ВариантыНапоминаний.ЧерезУказанноеВремя,1209600),"через 2 недели");

	
	// Если Объект.НапоминаниеИспользовать = Истина Тогда  
	//	РежимНапоминания = -1;
	// КонецЕсли;
	//
	
	
	// Проверка существования значения режима в списке
	Если Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия") Тогда 

		Интервал = Объект.ЗадачаНазначеннаяДатаВыполнения - Объект.НапоминаниеДатаНачала;
		Если элементы.ИнтервалДоНапоминания.СписокВыбора.НайтиПоЗначению(Интервал) = Неопределено Тогда
			       
		     ИнтервалМин = Цел( Интервал / 60);
			 Элементы.ИнтервалДоНапоминания.СписокВыбора.Добавить(Интервал, Строка(ИнтервалМин)+" минут");

	    КонецЕсли;
		
	 // Если указаное время напоминания не существует в списке, добавить это время в список выбора
	 ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ВУказанноеВремя") Тогда
		 
		 Если Элементы.ВремяНапоминания.СписокВыбора.НайтиПоЗначению(Объект.НапоминаниеДатаНачала) = Неопределено Тогда
			 
			  Элементы.ВремяНапоминания.СписокВыбора.Добавить(Объект.НапоминаниеДатаНачала,Формат(Объект.НапоминаниеДатаНачала,"ДФ=ЧЧ:мм"));
			  Элементы.ВремяНапоминания.СписокВыбора.СортироватьПоЗначению();
		 
		 КонецЕсли;	 
		  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработка изменения режима напоминания
Процедура РежимНапоминанияПриИзменении(Элемент)
	
	Объект.НапоминаниеРежим = РежимНапоминания.Режим;
	
	Если Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЗаВремяОтносительноСобытия") Тогда
		
		Элементы.ИнтервалДоНапоминания.Видимость = Истина;
		Элементы.ДатаНапоминания.Видимость       = Ложь;
		Элементы.ВремяНапоминания.Видимость      = Ложь;
			
	ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ВУказанноеВремя") Тогда 	
		
	    Элементы.ИнтервалДоНапоминания.Видимость = Ложь;
		Элементы.ДатаНапоминания.Видимость       = Истина;
		Элементы.ВремяНапоминания.Видимость      = Истина;
						
		Объект.НапоминаниеДатаНачала = ТекущаяДата();
		
	ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ПоСобытию") Тогда 
		
		Элементы.ИнтервалДоНапоминания.Видимость = Ложь;
		Элементы.ВремяНапоминания.Видимость      = Ложь;
		Элементы.ДатаНапоминания.Видимость       = Ложь;
		
	    Объект.НапоминаниеДатаНачала = Дата(0001,01,01,0,0,0);
		
    ИначеЕсли Объект.НапоминаниеРежим = ПредопределенноеЗначение("Перечисление.ВариантыНапоминаний.ЧерезУказанноеВремя") Тогда 
		
		Элементы.ИнтервалДоНапоминания.Видимость = Ложь;
		Элементы.ВремяНапоминания.Видимость      = Ложь;
		Элементы.ДатаНапоминания.Видимость       = Ложь;
		
		объект.НапоминаниеДатаНачала = Объект.Дата+ РежимНапоминания.Интервал; 
			
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик выбора исполнителя
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ИсполнительНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Задача.ЗадачаПользователей.Форма.ФормаВыбораИсполнителя",
	Новый Структура("Ключ",Объект.Исполнитель),,,,,
	Оповещение, 
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры                 

&НаКлиенте
// Процедура - После открытия формы выбора исполнителя
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ИсполнительНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.Исполнитель = ?(Результат <> Неопределено,Результат,Объект.Исполнитель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик изменения флага разрешения обработки напоминания
Процедура НапоминатьПриИзменении(Элемент)
	
	Элементы.ГруппаПараметрыНапоминания.Доступность = Объект.НапоминаниеИспользовать;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////////////////////////
// ДОПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//&НаСервере
//// Веренет таблицу сохраняемых элементов
// Функция ЭлементыДляСохранения()
//	
//	СохраняемыеЭлементы = Новый Структура("Задача,Исполнитель",Объект.ЗадачаТема,Объект.Исполнитель);
//	
//	Возврат СохранениеВводимыхЗначений.СформироватьТаблицуСохраненяемыхЭлементов(СохраняемыеЭлементы);
//	
// КонецФункции
